---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseB
source: html/ef56edb7-2545-4510-dfb9-732228292f49.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseB Property

The TrueCurrentPhaseB value of the Electrical System.

## Syntax (C#)
```csharp
public double TrueCurrentPhaseB { get; }
```

## Remarks
This property is used to retrieve the TrueCurrentPhaseB value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!